[
	{
		"date": "10/10/24",
		"changes": [
			"Added ability to modify action selections made with shift-click",
			"Fixed a bug where Between the Lines did not re-enable Ley Lines if toggled"
		]
	},
	{
		"date": "10/9/24",
		"changes": [
			"Page layout updates",
			"Lots of underlying implementation updates but shouldn't affect behavior",
			"A few Chinese localization updates"
		]
	},
	{
		"date": "9/26/24",
		"changes": [
			"Style update for remaining stacks",
			"Fix thunder 3 lasting for 30s in thunder stats table"
		]
	},
	{
		"date": "9/25/24",
		"changes": [
			"Added number of remaining stacks of Triplecast on hotbar"
		]
	},
	{
		"date": "9/21/24",
		"changes": [
			"Greatly reduced time needed to load a line"
		]
	},
	{
		"date": "9/10/24",
		"changes": [
			"Lines preset: when using a line created at a different level, adapt to current level by auto-converting equivalent skills if possible; throw an error otherwise"
		]
	},
	{
		"date": "9/5/24",
		"changes": [
			"Add image export feature"
		]
	},
	{
		"date": "9/3/24",
		"changes": [
			"Level sync for levels 70, 80, 90 - Thank you Turtle!!"
		]
	},
	{
		"date": "9/1/24",
		"changes": [
			"Bug fix: when the current slot contains resource override(s), adding a new slot crashes the tool (ty shanzhe and Turtle)",
			"Change Starry Muse party buff duration to 20.5s"
		]
	},
	{
		"date": "8/25/24",
		"changes": [
			"Remove \"extended buff duration\" config option and now triple always lasts 15.7s and firestarter lasts 30.5s",
			"Implement FPS tax and deprecate caster tax config option",
			"Update my contact email"
		]
	},
	{
		"date": "8/18/24",
		"changes": [
			"Tincture application delay -> 0.64s",
			"Add back ultimates markers presets"
		]
	},
	{
		"date": "8/17/24",
		"changes": [
			"Allow party buffs to last shorter than max duration",
			"Add link to Pictomancer in the Shell"
		]
	},
	{
		"date": "8/14/24",
		"changes": [
			"Raise warning when Amplifier is used at max polyglot stacks"
		]
	},
	{
		"date": "8/11/24",
		"changes": [
			"Revise PPS description and description for polyglot resource override condition",
			"Added M3S markers by shanzhe"
		]
	},
	{
		"date": "8/9/24",
		"changes": [
			"Akairyu - Fix a bug with Polyglot timer handling when Enochian resumes after an Umbral Soul pause"
		]
	},
	{
		"date": "8/8/24",
		"changes": [
			"Added M2S markers and log CSV parsing script by shanzhe"
		]
	},
	{
		"date": "8/4/24",
		"changes": [
			"Added M4S markers by shanzhe and removed presets from Endwalker."
		]
	},
	{
		"date": "7/31/24",
		"changes": [
			"patch 7.05 job changes",
			"bugfix: paradox sometimes not showing as \"available\" when looking at historical game states",
			"bugfix: retrace not available when LL buff exists but is disabled",
			"make LL enable itself when using LL",
			"show thunder tick number when hovering over damage mark"
		]
	},
	{
		"date": "7/29/24",
		"changes": [
			"New timeline marker type: party buffs! Huge thanks to Turtle for making this feature, and Galahad for their help with translation and proofreading.",
			"Updated High Thunder and Flare Star application delays, thanks to shanzhe.",
			"Updated cast time formula: cast times now have 3 digits of precision. See About this tool/Implementation notes for details.",
			"Updated most time-related UI to show 3 decimal places."
		]
	},
	{
		"date": "7/10/24",
		"changes": [
			"Update SPS and dot potency formulae to match Dawntrail (by Turtle)",
			"Adjust potion animation lock to normal instead of long 1.14s"
		]
	},
	{
		"date": "6/29/24 (2)",
		"changes": [
			"Let ice spells grant MP when on hit (as opposed to on snapshot). This is closer to what I observed in screen recordings.",
			"Umbral Soul has ~0.633s delay for MP gain, not instant.",
			"Manafont skill application delay is significantly shortened",
			"Thunderhead duration seems to be exact so \"extended buff times\" shouldn't change that",
			"Also put the above notes into \"About this tool/Implementation notes\" section",
			"A bit code cleanup"
		]
	},
	{
		"date": "6/29/24",
		"changes": [
			"preliminary 7.0 job changes",
			"localStorage refactor & migration (there should be a notice that links to the EW version when there's obsolete data)",
			"update PSA and \"About this tool\""
		]
	},
	{
		"date": "6/27/24",
		"changes": [
			"6/26 PSA before Dawntrail & 6/27 quick update"
		]
	},
	{
		"date": "6/21/24",
		"changes": [
			"Fixed a tiny bug: when switching language, source of damage on the timeline now updates just like the rest of UI",
			"Some housekeeping stuff: a dependency package update, repository README.md"
		]
	},
	{
		"date": "2/27/24",
		"changes": [
			"Let there be an empty timeline slot if none is loaded from localStorage. This should fix the issue that causes new user (browser) to get stuck when trying to use skills but there's no timeline."
		]
	},
	{
		"date": "12/14/23",
		"changes": [
			"Support up to 4 timeline slots. Have just 1 active at a time and let the other one(s) be references. This is a medium-large update so lmk if I accidentally broke something.",
			"QoL update: let the timeline window be large enough to show all slots and all markers"
		]
	},
	{
		"date": "12/12/23",
		"changes": [
			"fix paradox skill icon doesn't show up when displaying historical state",
			"refactored timeline renderer a bit"
		]
	},
	{
		"date": "11/20/23",
		"changes": [
			"let the old \"wait till next mp or lucid tick\" button also account for mp gain from manafont"
		]
	},
	{
		"date": "9/29/23",
		"changes": [
			"added DSR P6 markers by Tischel"
		]
	},
	{
		"date": "9/11/23",
		"changes": [
			"let PPS calculation exclude untargetable times"
		]
	},
	{
		"date": "9/7/23",
		"changes": [
			"added current tier's markers in Chinese, all from 不打冰3攻略组"
		]
	},
	{
		"date": "8/29/23",
		"changes": [
			"added p10s markers by Tischel",
			"added castTime to csv log output",
			"added a note about cast/recast time under LL in About/Implementation Notes"
		]
	},
	{
		"date": "8/9/23",
		"changes": [
			"bugfix: Surecast lasts 6s"
		]
	},
	{
		"date": "8/1/23",
		"changes": [
			"stats: thunder DoT coverage time & num ticks"
		]
	},
	{
		"date": "7/26/23",
		"changes": [
			"bugfix: overridden thunder ticks still counted as pending",
			"bugfix: potency for hovered skills on timeline could misalign with untargetable marker"
		]
	},
	{
		"date": "7/24/23",
		"changes": [
			"T3 table: gap times no longer count untargetable times",
			"minor code cleanup"
		]
	},
	{
		"date": "7/17/23",
		"changes": [
			"a bunch of T3 table improvements"
		]
	},
	{
		"date": "7/11/23",
		"changes": [
			"added p11s markers by Lilian"
		]
	},
	{
		"date": "7/7/23",
		"changes": [
			"DoT coverage gap / override times in T3 table"
		]
	},
	{
		"date": "7/3/23",
		"changes": [
			"added p12S p2 markers by Yara",
			"thunder DoT tick time offset is now fixed relative to mp ticks; see config, under lucid tick offset. This MAY break old fights with proc mode RNG. If one of your old files broke, you might be able to restore it by text editing the record and setting proc mode to Always. Or send it to me and I might be able to help.",
			"checkboxes for which skills/DoT to include in damage stats",
			"catch input file parse error"
		]
	},
	{
		"date": "7/1/23",
		"changes": [
			"added p9s and p12s p1 markers by Yara"
		]
	},
	{
		"date": "6/25/23",
		"changes": [
			"bugfix for stats.csv double counting tincture buff",
			"new export option fight.csv"
		]
	},
	{
		"date": "6/4/23",
		"changes": [
			"additional notes about untargetable marker (specifically, you may still get procs from DoT)",
			"bugfix: untargetable marker was causing some damage statistics error. also why didn't people tell me this earlier D:",
			"\"wait till next MP or lucid tick\" button"
		]
	},
	{
		"date": "5/23/23",
		"changes": [
			"patch 6.4 potency changes: enochian -> 23% buff, xenoglossy -> 880"
		]
	},
	{
		"date": "5/10/23",
		"changes": [
			"bugfix: using T3 consecutively should no longer break (ty moxian for the report!)"
		]
	},
	{
		"date": "4/3/23",
		"changes": [
			"\"Untargetable\" type timeline markers"
		]
	},
	{
		"date": "4/2/23",
		"changes": [
			"updated complete TOP markers by Santa",
			"fixed selected GCD skills accidentally counting abilities",
			"fixed another bizarre bug related to timeline editing.."
		]
	},
	{
		"date": "4/1/23",
		"changes": [
			"bugfix: make Between the Lines also available when outside of LL (oops...)"
		]
	},
	{
		"date": "3/31/23",
		"changes": [
			"made Between the Lines only available when there's LL"
		]
	},
	{
		"date": "3/29/23",
		"changes": [
			"rewrote damage statistics section"
		]
	},
	{
		"date": "3/27/23",
		"changes": [
			"always show recast progress bar when cd is not full (for skills with multiple stacks)",
			"show a warning mark on timeline when polyglot overcaps",
			"bugfix: another scenario that breaks the editor orz (moving around a sharpcast in a sequence of umbral souls)"
		]
	},
	{
		"date": "3/14/23",
		"changes": [
			"quick patch: put back 'apply changes' button"
		]
	},
	{
		"date": "3/10/23",
		"changes": [
			"negative countdown to start from a specific time",
			"modified triplecast buff icon to show 2 & 3 stacks"
		]
	},
	{
		"date": "3/9/23",
		"changes": [
			"bugfix: addressed a situation that may cause the timeline editor to incorrectly scream abt invalid edits",
			"↑ (later today) changed this a bit more: auto-apply valid edits & prevent edits from affecting earlier parts of the timeline",
			"a few translation updates"
		]
	},
	{
		"date": "3/6/23",
		"changes": [
			"qol: auto scroll editor when clicked on a skill on timeline and vice versa (only works for skills though)",
			"updated TOP markers from Santa"
		]
	},
	{
		"date": "3/4/23",
		"changes": [
			"dark mode",
			"changed default proc mode to never (doesn't affect existing files and caches)",
			"misc rendering bug fixes"
		]
	},
	{
		"date": "3/3/23",
		"changes": [
			"translation updates mostly by Eshiya",
			"bugfix: previously need to mouseover the timeline to delete skills",
			"bugfix: couldn't hide F1/B1/Paradox skill description"
		]
	},
	{
		"date": "2/28/23",
		"changes": [
			"updated TOP markers from Santa",
			"bugfix: lucid dreaming sometimes doesn't tick after deleting stuff from the timeline",
			"performance optimization: basically rewrote timeline rendering using canvas. Goodbye slow slow html DOM"
		]
	},
	{
		"date": "2/27/23",
		"changes": [
			"performance optimization prep work: move most of timeline rendering to canvas and use DOM only for interaction",
			"total & selected GCD skills count",
			"hover on timeline header & markers to see exact time"
		]
	},
	{
		"date": "2/26/23",
		"changes": [
			"fix markers not updating when timeline scale changes"
		]
	},
	{
		"date": "2/25/23(2)",
		"changes": [
			"translation updates by Eshiya",
			"fix config section showing all 0s",
			"a bit performance optimization"
		]
	},
	{
		"date": "2/25/23",
		"changes": [
			"let tincture affect potency calculation- display only; not saved to record files",
			"make the stats orange when showing historical game state",
			"display damage stats by skill",
			"can now download damage log as csv file",
			"remove duplicate markers button",
			"updated Instructions/Troubleshoot"
		]
	},
	{
		"date": "2/24/23",
		"changes": [
			"hover over mp tick mark to see tick info",
			"delete key now also deletes timeline actions",
			"skills implementation: aetherial manip & between the lines animation lock -> 0.8s, manafont skill application delay -> 0.88s",
			"indicate which spells are covered by LL: when skill is ready and hovered and when it's used on the timeline（with a yellow underline)",
			"make it an option to proc probabilistically/always/never",
			"misc bug fixes"
		]
	},
	{
		"date": "2/23/23",
		"changes": [
			"added p5s-p8s markers in Chinese by 不打冰3攻略组. Thank you all!!"
		]
	},
	{
		"date": "2/18/23",
		"changes": [
			"added localization framework; Chinese translation work in progress & added my contact QQ under About in Chinese ver. Was kinda surprised that this tool gets a significant portion of traffic from China :0",
			"才发现好像国服有人用这个东西:0 本地化在做了在做了，好怪啊我译我自己。。在中文版的关于里放了我的联系QQ。"
		]
	},
	{
		"date": "2/17/23",
		"changes": [
			"updated TOP markers from Santa"
		]
	},
	{
		"date": "1/24/23",
		"changes": [
			"added TOP P1 markers by Santa (thank you!)",
			"added instruction: you can shift-scroll the timeline",
			"minimal timeline editing features"
		]
	},
	{
		"date": "12/20/22",
		"changes": [
			"bugfix: misc fixes related to resource overrides (ty sotsu); also can now add override to polyglot timer"
		]
	},
	{
		"date": "12/16/22",
		"changes": [
			"added a checkbox to let a few buffs last slightly longer which is closer to actual game behavior (thank you itu from The Balance). See Config/Edit"
		]
	},
	{
		"date": "12/15/22",
		"changes": [
			"bugfix: Despair consumes umbral heart (it shouldn't)"
		]
	},
	{
		"date": "12/13/22",
		"changes": [
			"display historical game state at the start of the first selected skill",
			"other miscellaneous ui & code cleanups",
			"bugfix: broken right click to choose download location",
			"bugfix: broken resetAll and resetResourceOverrides command links"
		]
	},
	{
		"date": "10/31/22",
		"changes": [
			"6.28 job adjustments: foul & xenoglossy potency increase; enochian buff -> 21%"
		]
	},
	{
		"date": "10/3/22",
		"changes": [
			"when hovered on a skill, show its captured cast time and time till application"
		]
	},
	{
		"date": "10/2/22",
		"changes": [
			"update legacy timeline marker presets and fix not being able to load them from file"
		]
	},
	{
		"date": "9/18/22",
		"changes": [
			"add a lot of missing ability skill application delay times (see implementation notes) and get rid of the 0.1s estimates",
			"bugfix: t3p refreshed buff timer instantly; it now refreshes after skill application delay"
		]
	},
	{
		"date": "9/7/22",
		"changes": [
			"add link to Spider's Bozjan version of this tool"
		]
	},
	{
		"date": "9/2/22",
		"changes": [
			"bugfix: timeTillNextManaTick wasn't updated correctly"
		]
	},
	{
		"date": "8/28/22",
		"changes": [
			"show orange dotted lines around some skills just like in game",
			"(also this is probably the last feature update for now because of irl priorities, but I can still come back to fix bugs)"
		]
	},
	{
		"date": "8/26/22",
		"changes": [
			"option to save multiple marker tracks into the same file",
			"option to save files to specified locations",
			"let timeline marker tracks have alternating background colors",
			"some simple checks for resource override validity (AF/UI/UH with enochian)"
		]
	},
	{
		"date": "8/23/22",
		"changes": [
			"bugfix: F3P and T3P refreshed at damage application time (now refresh on button press which is also snapshot time)",
			"bugfix: Amplifier could be used without AF/UI (now AF/UI is required)"
		]
	},
	{
		"date": "8/15/22",
		"changes": [
			"[not extensively tested] customize initial resources (see Config/Edit on the right)",
			"add URL commands to reset browser cache, in case it's messed up (see Insructions/Troubleshoot)",
			"some other minor UI changes"
		]
	},
	{
		"date": "8/5/22",
		"changes": [
			"page refresh and loading from timeline no longer removes wait time at the end",
			"\"remove trailing idle time\" button",
			"bugfix: caster tax being dependent on framerate when in real time (if desired, add it to config instead)",
			"bugfix: hover on skills on the timeline doesn't show potency & lock duration"
		]
	},
	{
		"date": "7/31/22",
		"changes": [
			"add sprint",
			"make lucid tick offset random relative to mp tick",
			"use a checkbox to turn rng procs on/off"
		]
	},
	{
		"date": "7/30/22",
		"changes": [
			"specify wait time since the last skill is used",
			"add DSR P7 timeline track preset by Santa (Thank you!!)",
			"(try to) prevent timeline overscroll"
		]
	},
	{
		"date": "7/29/22",
		"changes": [
			"pin timeline to the bottom of the page plus some layout changes",
			"add a link to my roadmap page",
			"option to jump to a specific time",
			"bugfix: hovering over timeline cursor shows incorrect game time"
		]
	},
	{
		"date": "7/24/22",
		"changes": [
			"accurate tincture lock time",
			"fix 'load from file' not responding when trying to load the same file for the 2nd time",
			"make sure timeline ruler covers all markers, regardless of countdown time"
		]
	},
	{
		"date": "7/18/22",
		"changes": [
			"hotfix for flare taking both umbral heart stacks and all mp; accurate flare mp cost calculation",
			"when viewing historical game state, hover over a skill to view its availability at the specified time point"
		]
	},
	{
		"date": "7/3/22",
		"changes": [
			"press u to delete the last action (undo)",
			"added \"last updated\" line",
			"added google analytics tag"
		]
	},
	{
		"date": "6/27/22",
		"changes": [
			 "ayyee coming back for a couple of features lined up in the next two weeks or so. For now just updated some node dependencies."
		]
	},
	{
		"date": "5/26/22",
		"changes": [
			"leaving this thingy for now but if anyone encounters bugs and/or gets confused let me know. I can always come back to fix things."
		]
	},
	{
		"date": "5/7/22 (yes I'm still working on it)",
		"changes": [
			"added support for enabling/disabling ley lines and removing buffs applied to self"
		]
	},
	{
		"date": "5/3/22",
		"changes": [
			"added this section so most people can stay here instead of go and look at my messy code and commit messages",
			"fixed a performance issue related to viewing historical game states.",
			"added a few implementation notes"
		]
	},
	{
		"date": "5/2/22",
		"changes": [
			"can now view historical game states by clicking on the timeline"
		]
	}
]
