[
	{
		"date": "3/24/25",
		"changes": [
			"We have updated the site in accordance with the 7.2 patch notes. Goodbye to the Enochian timer o7",
			"[BLM] will remain in \"testing\" status until we have a change to play with the changes in-game.",
			"Since most jobs received only potency changes, your old 7.1 plans should work, but as usual, please let us know if anything seems incorrect."
		]
	},
	{
		"date": "3/20/25",
		"changes": [
			"[DNC] Fixed an issue where the icons for Finishing Move Ready and Last Dance Ready were swapped, and an issue where Last Dance Ready was not consumed by Last Dance (thank you bluke)"
		]
	},
	{
		"date": "3/16/25",
		"changes": [
			"Fixed an issue where resource toggles were shown in their timeline editor with their internal keys rather than localized test.",
			"Fixed mistakes in DoT effect override calculations.",
			"In anticipation of patch 7.2, we're working on some changes to make it easier to migrate timelines after site or game changes. The following things have changed:",
			"- Single-clicking an action will now try to use it as soon as the current animation lock/skill cooldown is over (this used to require double-clicking). If the action cannot be used, a wait is automatically added to the timeilne.",
			"- In \"manual\" control mode, you no longer need to press space to advance past an action's animation lock (it will now advance automatically when a skill is used).",
			"- Displayed wait durations are now always calculated from the end of the previous animation lock. Any existing timelines will automatically be adjusted--the shown wait times may be different, but the times where actions are used will remain the same.",
			"- Skill sequence presets now include wait durations. This lets you load/save sequences that use late weaves or wait for MP ticks (assuming ticks still line up quietly).",
			"As a consequence of these changes, you actually might now be able to load BLM timelines from 7.05/7.0 that previously were broken as a result of Despair becoming instant. Despair will still be instant and other buff usage will be unchanged, but the time between abilities should be correct.",
			"These changes are very large, and while we've tested to make sure they won't break your existing timelines, there might still be some bugs that slipped through the cracks. As always, please reach out to us if you encounter any problems."
		]
	},
	{
		"date": "3/1/25",
		"changes": [
			"Make it so that you can only delete the currently active slot, to hopefully reduce the chance of accidentally deleting a slot when switching"
		]
	},
	{
		"date": "2/26/25",
		"changes": [
			"Updated the GCD formula because the old formula may be off by 0.01s when there is haste buff. Thank you Yuyuka for spotting the error. Note: old timelines (including timelines in browser localStorage) aren't affected; only newly created timelines use the new formula."
		]
	},
	{
		"date": "2/22/25",
		"changes": [
			"Added Queen Eternal markers by 小盐"
		]
	},
	{
		"date": "2/21/25",
		"changes": [
			"[BRD][GNB][SMN] Removed testing tag"
		]
	},
	{
		"date": "2/20/25",
		"changes": [
			"[SGE] Initial implementation for SGE",
			"- Some rough edges still exist around Krasis' healing potency modification and Eukrasian shield handling.",
			"- Basic functionality should be reasonably complete.",
			"[RDM] Fixed a bug where Manafication could be used before combat"
		]
	},
	{
		"date": "2/16/25",
		"changes": [
			"[SAM] Fixed Hagakure only being usable at 3 sen"
		]
	},
	{
		"date": "2/15/25",
		"changes": [
			"[BLM] Fixed Manafont CD at lvl80 and below: should be 120s"
		]
	},
	{
		"date": "2/13/25",
		"changes": [
			"Updated English FRU tracks to more accurately reflect downtime between phases. We previously used the \"death\" event in a log as the end of a phase, but it turns out this is inaccurate as the last damage application to the boss occurs ~2 seconds before its recorded death.",
			"- P1 to P2 untargetable duration increased by 2 seconds",
			"- P2 to intermission untargetable duration decreased to align with the \"crystals become targetable\" mark",
			"- Intermission to P3 downtime increased to match Gaia's attack killing the crystal",
			"In order to not break existing timelines, the preset EN full fight track now treats P1 as dying 2 seconds before the end of the enrage cast. The start times of all phases are unaffected."
		]
	},
	{
		"date": "2/4/25",
		"changes": [
			"[SAM] Fixed AoE combo actions not ending the combo",
			"[DRG] Added initial support for DRG"
		]
	},
	{
		"date": "2/2/25",
		"changes": [
			"[BRD][DNC] Fixed bonuses given from certain crit/DH buffs not applying in total potency calculations"
		]
	},
	{
		"date": "2/1/25",
		"changes": [
			"[WAR][SAM][RPR][MCH][DNC] Implemented localization for some recently added jobs"
		]
	},
	{
		"date": "1/27/25",
		"changes": [
			"[SMN] Added initial support for SMN"
		]
	},
	{
		"date": "1/26/25",
		"changes": [
			"[WAR][GNB] Fixed missing icon for tank LB3s"
		]
	},
	{
		"date": "1/18/25",
		"changes": [
			"[GNB] Added initial support for GNB"
		]
	},
	{
		"date": "1/17/25",
		"changes": [
			"Added \"move end of selection to start of selection\" button to the timeline editor"
		]
	},
    {
        "date": "1/12/25",
        "changes": [
            "[RPR] Fixed a bug where oGCDs would improperly consume Reaver/Executioner stacks"
        ]
    },
	{
		"date": "1/8/25",
		"changes": [
			"[WAR] Fixed surging tempest text not showing up in potency modifier tooltip",
			"[MCH] Fixed Overheated potency modifier not being applied"
		]
	},
	{
		"date": "1/5/25",
		"changes": [
			"Fixed a bug where multi-target spells lost their target counts when using the timeline editor"
		]
	},
	{
		"date": "1/4/25",
		"changes": [
			"Added support for multi-target abilities"
		]
	},
	{
		"date": "1/3/25",
		"changes": [
			"[WAR][SAM][RPR] Removed testing tag"
		]
	},
	{
		"date": "1/1/25",
		"changes": [
			"Added combined English FRU tracks"
		]
	},
	{
		"date": "12/28/24",
		"changes": [
			"[PCT] Fixed warning for Palette Gauge overcap"
		]
	},
	{
		"date": "12/24/24",
		"changes": [
			"[MCH] Added support for Flamethrower"
		]
	},
	{
		"date": "12/22/24",
		"changes": [
			"[BRD] Added initial support for BRD",
			"Overhaul DoT tracking to provide better usage statistics",
			"[BLM] Added High Thunder II"
		]
	},
	{
		"date": "12/20/24",
		"changes": [
			"Fixed stats tables not including party buff potencies for most skills",
			"Removed flank/rear positional resources for non-melee jobs"
		]
	},
	{
		"date": "12/19/24",
		"changes": [
			"[WAR] Adjusted animation lock of Primal Rend",
			"Fixed Down for the Count timing in FRU P4 (thanks xi12570)"
		]
	},
	{
		"date": "12/16/24",
		"changes": [
			"Limit breaks for all jobs!",
			"[MCH][DNC] Removed testing tag",
			"Updated \"About this tool\" section",
			"More underlying implementation changes",
			"[PCT] Made Hammer combo expire with Hammer Time buff (changed in 7.1)"
		]
	},
	{
		"date": "12/13/24",
		"changes": [
			"Fixed sometimes unable to use skills in manual mode with double click",
			"[RPR] Added timer for Immortal Sacrifice",
			"[RPR] Removed enhanced reapings whenever shroud is exited",
			"[RPR] Separated cooldowns of Sacrificium and Lemure's Slice",
			"[RPR] Fixed sks scaling",
			"[WAR] Added initial WAR support"
		]
	},
	{
		"date": "12/12/24",
		"changes": [
			"Updated English FRU tracks and added P4 + P5"
		]
	},
	{
		"date": "12/8/24",
		"changes": [
			"Updated Chinese FRU tracks to latest (12/8 ver)",
			"Make stats tables only include selected skills when there is selection"
		]
	},
	{
		"date": "12/7/24",
		"changes": [
			"Updated positional buff icons",
			"Misc cleanups and optimizations (hey devs: rerun npm install)",
			"[BLM] Fixed Retrace button not changing back to LL if LL is disabled when the buff drops"
		]
	},
	{
		"date": "12/5/24",
		"changes": [
			"Updated Chinese FRU tracks to latest (12/2 version)",
			"Additional Chinese localization changes (preset lines; initial resource overrides section; many resource names)",
			"New skill icon progress bar visuals 🎉"
		]
	},
	{
		"date": "12/4/24",
		"changes": [
			"Added English FRU P3 tracks by Yara",
			"[RDM] Fixed Swiftcast being consumed before Dualcast when both are active"
		]
	},
	{
		"date": "12/2/24",
		"changes": [
			"Added English FRU P2 tracks by Yara",
			"Fixed a bug where 'Load tracks starting at timestamp' did not accept some time formats",
			"[RDM] Removed the 'testing' label"
		]
	},
	{
		"date": "12/1/24",
		"changes": [
			"Updated full FRU tracks in Chinese by 盐宝 & czmm"
		]
	},
	{
		"date": "11/30/24",
		"changes": [
			"[MCH] Fixed Scattergun's heat generation (thanks Kairos)",
			"[PCT] Fixed Monochrome Tones appearing when synced to level 80 and other internal trait logic (thanks misterperson)"
		]
	},
	{
		"date": "11/29/24",
		"changes": [
			"[MCH] Fixed bugs with MCH Overheat consumption on AoE abilities (thanks FloatingGhost)"
		]
	},
	{
		"date": "11/28/24",
		"changes": [
			"Added some Chinese tracks (M1S-M4S, FRU before P2.5)"
		]
	},
	{
		"date": "11/27/24",
		"changes": [
			"Added the ability to override stacks to 0 for 1-stack resources that start present by default",
			"Added preliminary FRU P1 tracks by Yara"
		]
	},
	{
		"date": "11/26/24",
		"changes": [
			"Added the ability to load marker tracks starting from a particular timestamp"
		]
	},
	{
		"date": "11/25/24",
		"changes": [
			"[RPR] Added initial RPR support"
		]
	},
	{
		"date": "11/24/24",
		"changes": [
			"[MCH] Added initial MCH support"
		]
	},
	{
		"date": "11/21/24",
		"changes": [
			"[SAM] Fixed a bug where Fuka haste was doubly applied",
			"[SAM] Added GCD under Fuka in playback control"
		]
	},
	{
		"date": "11/20/24",
		"changes": [
			"[DNC] Added initial DNC support",
			"[SAM] Added initial SAM support (thank you Sterling Sylva for the initial work)",
			"Added support for skill speed in addition to spell speed"
		]
	},
	{
		"date": "11/17/24",
		"changes": [
			"[RDM] Fix Manafication CD (thanks 云青渔语)",
			"[all casters] Fix Surecast duration: previously 10s, now 6.5s (ty erii)"
		]
	},
	{
		"date": "11/16/24",
		"changes": [
			"Make DET use main stat formula and default to 440",
			"Add hyperlinks for xivgear and etro"
		]
	},
	{
		"date": "11/15/24",
		"changes": [
			"(thank you Yuyuka for reporting a bunch of RDM bugs)",
			"[RDM] Added some additional warnings on unintended buff drops, overwrites, and combo breaks",
			"[RDM] Fixed the duration of the Acceleration buff",
			"[RDM] Fixed the MP costs of Veraero II/Verthunder II",
			"[RDM] Fixed Manafication failing to interrupt combos",
			"[RDM] Fixed Manafication being usable out of combat",
			"[RDM] Fixed Enchanted Reprise clearing mana stacks",
			"[RDM] Made Prefulgence and Vice of Thorns into button replacements"
		]
	},
	{
		"date": "11/14/24",
		"changes": [
			"(thank you Wan Shott for reporting a bunch of RDM bugs)",
			"[RDM] Fixed bugs where Verfire and Grand Impact didn't grant correct mana",
			"[RDM] Fixed a bug where it was possible to use un-enchanted Moulinet under certain incorrect conditions",
			"mark newly-implemented jobs as in testing and display a warning message when using those jobs"
		]
	},
	{
		"date": "11/13/24",
		"changes": [
			"Fixed a bug where party buff potencies were not displayed",
			"[PCT] Fixed a bug where using two hammer combos within 30s of each other caused the combo to break",
			"[RDM] Fixed a bug where level synced RDM still received Grand Impact Ready from Acceleration",
			"[RDM] Fixed a bug where Acceleration did not always grant a Verstone/Verfire proc",
			"[RDM] Fixed a bug where certain role buffs were not being displayed on the hotbar",
			"[RDM] Fixed a bug where buffs were overlapping the hotbar",
			"[RDM] Fixed a bug where Contre Sixte's cooldown was improperly affected by traits",
			"Removed debug and implementation notes sections (see repository wiki for implementation notes)"
		]
	},
	{
		"date": "11/12/24",
		"changes": [
			"Initial XIV in the Shell! Supporting patch 7.1 BLM and PCT, plus preliminary RDM"
		]
	}
]
